Revit 2027 API
IFCOpeningDimensions Methods
The IFCOpeningDimensions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetOpeningHandle |  Gets the IFC opening element handle.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace